src/test/resources/biz/turnonline/ecosystem/payment/api/model/transaction.json

{
    "amount": 35.0,
    "balance": 20.0,
    "completedAt": "2020-03-06T09:11:37.960098Z",
    "credit": false,
    "currency": "EUR",
    "key": "123xyz",
    "reference": "Payment for online service",
    "status": "COMPLETED",
    "type": "TRANSFER",
    "bankAccount": {
        "iban": "GB05 REVO 3768 7428 278420",
        "code": "REVO"
    },
    "bill": {
        "invoice": 123,
        "order": 456
    }
}